MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1559/mcu.h
extern volatile AD1CAPCONbits_t AD1CAPCONbits __at(0x719);
// bitfield macros
#define _AD1CAPCON_ADDCAP_POSN                              0x0
#define _AD1CAPCON_ADDCAP_POSITION                          0x0
#define _AD1CAPCON_ADDCAP_SIZE                              0x4
#define _AD1CAPCON_ADDCAP_LENGTH                            0x4
#define _AD1CAPCON_ADDCAP_MASK                              0xF
#define _AD1CAPCON_ADCAP_POSN                               0x0
#define _AD1CAPCON_ADCAP_POSITION                           0x0
#define _AD1CAPCON_ADCAP_SIZE                               0x4
#define _AD1CAPCON_ADCAP_LENGTH                             0x4
#define _AD1CAPCON_ADCAP_MASK                               0xF
#define _AD1CAPCON_ADDCAP0_POSN                             0x0
#define _AD1CAPCON_ADDCAP0_POSITION                         0x0
#define _AD1CAPCON_ADDCAP0_SIZE                             0x1
#define _AD1CAPCON_ADDCAP0_LENGTH                           0x1
#define _AD1CAPCON_ADDCAP0_MASK                             0x1
#define _AD1CAPCON_ADDCAP1_POSN                             0x1
#define _AD1CAPCON_ADDCAP1_POSITION                         0x1
#define _AD1CAPCON_ADDCAP1_SIZE                             0x1
#define _AD1CAPCON_ADDCAP1_LENGTH                           0x1
#define _AD1CAPCON_ADDCAP1_MASK                             0x2
#define _AD1CAPCON_ADDCAP2_POSN                             0x2
#define _AD1CAPCON_ADDCAP2_POSITION                         0x2
#define _AD1CAPCON_ADDCAP2_SIZE                             0x1
#define _AD1CAPCON_ADDCAP2_LENGTH                           0x1
#define _AD1CAPCON_ADDCAP2_MASK                             0x4
#define _AD1CAPCON_ADDCAP3_POSN                             0x3
#define _AD1CAPCON_ADDCAP3_POSITION                         0x3
#define _AD1CAPCON_ADDCAP3_SIZE                             0x1
#define _AD1CAPCON_ADDCAP3_LENGTH                           0x1
#define _AD1CAPCON_ADDCAP3_MASK                             0x8
#define _AD1CAPCON_ADD1CAP_POSN                             0x0
#define _AD1CAPCON_ADD1CAP_POSITION                         0x0
#define _AD1CAPCON_ADD1CAP_SIZE                             0x4
#define _AD1CAPCON_ADD1CAP_LENGTH                           0x4
#define _AD1CAPCON_ADD1CAP_MASK                             0xF
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADDCAP                 :4;
    };
    struct {
        unsigned ADCAP                  :4;
    };
    struct {
        unsigned ADDCAP0                :1;
        unsigned ADDCAP1                :1;
        unsigned ADDCAP2                :1;
        unsigned ADDCAP3                :1;
    };
    struct {
        unsigned ADD1CAP                :4;
    };
} AADCAPbits_t;
extern volatile AADCAPbits_t AADCAPbits __at(0x719);
// bitfield macros
#define _AADCAP_ADDCAP_POSN                                 0x0
#define _AADCAP_ADDCAP_POSITION                             0x0
#define _AADCAP_ADDCAP_SIZE                                 0x4
#define _AADCAP_ADDCAP_LENGTH                               0x4
#define _AADCAP_ADDCAP_MASK                                 0xF
#define _AADCAP_ADCAP_POSN                                  0x0
#define _AADCAP_ADCAP_POSITION                              0x0
#define _AADCAP_ADCAP_SIZE                                  0x4
#define _AADCAP_ADCAP_LENGTH                                0x4
#define _AADCAP_ADCAP_MASK                                  0xF
#define _AADCAP_ADDCAP0_POSN                                0x0
#define _AADCAP_ADDCAP0_POSITION                            0x0
#define _AADCAP_ADDCAP0_SIZE                                0x1
#define _AADCAP_ADDCAP0_LENGTH                              0x1
#define _AADCAP_ADDCAP0_MASK                                0x1
#define _AADCAP_ADDCAP1_POSN                                0x1
#define _AADCAP_ADDCAP1_POSITION                            0x1
#define _AADCAP_ADDCAP1_SIZE                                0x1
#define _AADCAP_ADDCAP1_LENGTH                              0x1
#define _AADCAP_ADDCAP1_MASK                                0x2
#define _AADCAP_ADDCAP2_POSN                                0x2
#define _AADCAP_ADDCAP2_POSITION                            0x2
#define _AADCAP_ADDCAP2_SIZE                                0x1
#define _AADCAP_ADDCAP2_LENGTH                              0x1
#define _AADCAP_ADDCAP2_MASK                                0x4
#define _AADCAP_ADDCAP3_POSN                                0x3
#define _AADCAP_ADDCAP3_POSITION                            0x3
#define _AADCAP_ADDCAP3_SIZE                                0x1
#define _AADCAP_ADDCAP3_LENGTH                              0x1
#define _AADCAP_ADDCAP3_MASK                                0x8
#define _AADCAP_ADD1CAP_POSN                                0x0
#define _AADCAP_ADD1CAP_POSITION                            0x0
#define _AADCAP_ADD1CAP_SIZE                                0x4
#define _AADCAP_ADD1CAP_LENGTH                              0x4
#define _AADCAP_ADD1CAP_MASK                                0xF
typedef union {
    struct {
        unsigned ADDCAP                 :4;
    };
    struct {
        unsigned ADCAP                  :4;
    };
    struct {
        unsigned ADDCAP0                :1;
        unsigned ADDCAP1                :1;
        unsigned ADDCAP2                :1;
        unsigned ADDCAP3                :1;
    };
    struct {
        unsigned ADD1CAP                :4;
    };
} AAD1CAPbits_t;
extern volatile AAD1CAPbits_t AAD1CAPbits __at(0x719);
// bitfield macros
#define _AAD1CAP_ADDCAP_POSN                                0x0
#define _AAD1CAP_ADDCAP_POSITION                            0x0
#define _AAD1CAP_ADDCAP_SIZE                                0x4
#define _AAD1CAP_ADDCAP_LENGTH                              0x4
#define _AAD1CAP_ADDCAP_MASK                                0xF
#define _AAD1CAP_ADCAP_POSN                                 0x0
#define _AAD1CAP_ADCAP_POSITION                             0x0
#define _AAD1CAP_ADCAP_SIZE                                 0x4
#define _AAD1CAP_ADCAP_LENGTH                               0x4
#define _AAD1CAP_ADCAP_MASK                                 0xF
#define _AAD1CAP_ADDCAP0_POSN                               0x0
#define _AAD1CAP_ADDCAP0_POSITION                           0x0
#define _AAD1CAP_ADDCAP0_SIZE                               0x1
#define _AAD1CAP_ADDCAP0_LENGTH                             0x1
#define _AAD1CAP_ADDCAP0_MASK                               0x1
#define _AAD1CAP_ADDCAP1_POSN                               0x1
#define _AAD1CAP_ADDCAP1_POSITION                           0x1
#define _AAD1CAP_ADDCAP1_SIZE                               0x1
#define _AAD1CAP_ADDCAP1_LENGTH                             0x1
#define _AAD1CAP_ADDCAP1_MASK                               0x2
#define _AAD1CAP_ADDCAP2_POSN                               0x2
#define _AAD1CAP_ADDCAP2_POSITION                           0x2
#define _AAD1CAP_ADDCAP2_SIZE                               0x1
#define _AAD1CAP_ADDCAP2_LENGTH                             0x1
#define _AAD1CAP_ADDCAP2_MASK                               0x4
#define _AAD1CAP_ADDCAP3_POSN                               0x3
#define _AAD1CAP_ADDCAP3_POSITION                           0x3
#define _AAD1CAP_ADDCAP3_SIZE                               0x1
#define _AAD1CAP_ADDCAP3_LENGTH                             0x1
#define _AAD1CAP_ADDCAP3_MASK                               0x8
#define _AAD1CAP_ADD1CAP_POSN                               0x0
#define _AAD1CAP_ADD1CAP_POSITION                           0x0
#define _AAD1CAP_ADD1CAP_SIZE                               0x4
#define _AAD1CAP_ADD1CAP_LENGTH                             0x4
#define _AAD1CAP_ADD1CAP_MASK                               0xF
typedef union {
    struct {
        unsigned ADDCAP                 :4;
    };
    struct {
        unsigned ADCAP                  :4;
    };
    struct {
        unsigned ADDCAP0                :1;
        unsigned ADDCAP1                :1;
        unsigned ADDCAP2                :1;
        unsigned ADDCAP3                :1;
    };
    struct {
        unsigned ADD1CAP                :4;
    };
} AAD1CAPCONbits_t;
extern volatile AAD1CAPCONbits_t AAD1CAPCONbits __at(0x719);
// bitfield macros
#define _AAD1CAPCON_ADDCAP_POSN                             0x0
#define _AAD1CAPCON_ADDCAP_POSITION                         0x0
#define _AAD1CAPCON_ADDCAP_SIZE                             0x4
#define _AAD1CAPCON_ADDCAP_LENGTH                           0x4
#define _AAD1CAPCON_ADDCAP_MASK                             0xF
#define _AAD1CAPCON_ADCAP_POSN                              0x0
#define _AAD1CAPCON_ADCAP_POSITION                          0x0
#define _AAD1CAPCON_ADCAP_SIZE                              0x4
#define _AAD1CAPCON_ADCAP_LENGTH                            0x4
#define _AAD1CAPCON_ADCAP_MASK                              0xF
#define _AAD1CAPCON_ADDCAP0_POSN                            0x0
#define _AAD1CAPCON_ADDCAP0_POSITION                        0x0
#define _AAD1CAPCON_ADDCAP0_SIZE                            0x1
#define _AAD1CAPCON_ADDCAP0_LENGTH                          0x1
#define _AAD1CAPCON_ADDCAP0_MASK                            0x1
#define _AAD1CAPCON_ADDCAP1_POSN                            0x1
#define _AAD1CAPCON_ADDCAP1_POSITION                        0x1
#define _AAD1CAPCON_ADDCAP1_SIZE                            0x1
#define _AAD1CAPCON_ADDCAP1_LENGTH                          0x1
#define _AAD1CAPCON_ADDCAP1_MASK                            0x2
#define _AAD1CAPCON_ADDCAP2_POSN                            0x2
#define _AAD1CAPCON_ADDCAP2_POSITION                        0x2
#define _AAD1CAPCON_ADDCAP2_SIZE                            0x1
#define _AAD1CAPCON_ADDCAP2_LENGTH                          0x1
#define _AAD1CAPCON_ADDCAP2_MASK                            0x4
#define _AAD1CAPCON_ADDCAP3_POSN                            0x3
#define _AAD1CAPCON_ADDCAP3_POSITION                        0x3
#define _AAD1CAPCON_ADDCAP3_SIZE                            0x1
#define _AAD1CAPCON_ADDCAP3_LENGTH                          0x1
#define _AAD1CAPCON_ADDCAP3_MASK                            0x8
#define _AAD1CAPCON_ADD1CAP_POSN                            0x0
#define _AAD1CAPCON_ADD1CAP_POSITION                        0x0
#define _AAD1CAPCON_ADD1CAP_SIZE                            0x4
#define _AAD1CAPCON_ADD1CAP_LENGTH                          0x4
#define _AAD1CAPCON_ADD1CAP_MASK                            0xF

// Register: AAD1RES0
#define AAD1RES0 AAD1RES0
extern volatile unsigned short          AAD1RES0            __at(0x71A);
#ifndef _LIB_BUILD
asm("AAD1RES0 equ 071Ah");
#endif
// aliases
extern volatile unsigned short          AD1RES0             __at(0x71A);
#ifndef _LIB_BUILD
asm("AD1RES0 equ 071Ah");
#endif
extern volatile unsigned short          ADRES0              __at(0x71A);
#ifndef _LIB_BUILD
asm("ADRES0 equ 071Ah");
#endif

// Register: AAD1RES0L
#define AAD1RES0L AAD1RES0L
extern volatile unsigned char           AAD1RES0L           __at(0x71A);
#ifndef _LIB_BUILD
asm("AAD1RES0L equ 071Ah");
#endif
// aliases
extern volatile unsigned char           AD1RES0L            __at(0x71A);
#ifndef _LIB_BUILD
asm("AD1RES0L equ 071Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESL                 :8;
    };
} AAD1RES0Lbits_t;
extern volatile AAD1RES0Lbits_t AAD1RES0Lbits __at(0x71A);
// bitfield macros
#define _AAD1RES0L_ADRESL_POSN                              0x0
#define _AAD1RES0L_ADRESL_POSITION                          0x0
#define _AAD1RES0L_ADRESL_SIZE                              0x8
#define _AAD1RES0L_ADRESL_LENGTH                            0x8
#define _AAD1RES0L_ADRESL_MASK                              0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADRESL                 :8;
    };
} AD1RES0Lbits_t;
