MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1559/mcu.h
extern volatile AD1RES0Lbits_t AD1RES0Lbits __at(0x71A);
// bitfield macros
#define _AD1RES0L_ADRESL_POSN                               0x0
#define _AD1RES0L_ADRESL_POSITION                           0x0
#define _AD1RES0L_ADRESL_SIZE                               0x8
#define _AD1RES0L_ADRESL_LENGTH                             0x8
#define _AD1RES0L_ADRESL_MASK                               0xFF

// Register: AAD1RES0H
#define AAD1RES0H AAD1RES0H
extern volatile unsigned char           AAD1RES0H           __at(0x71B);
#ifndef _LIB_BUILD
asm("AAD1RES0H equ 071Bh");
#endif
// aliases
extern volatile unsigned char           AD1RES0H            __at(0x71B);
#ifndef _LIB_BUILD
asm("AD1RES0H equ 071Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
} AAD1RES0Hbits_t;
extern volatile AAD1RES0Hbits_t AAD1RES0Hbits __at(0x71B);
// bitfield macros
#define _AAD1RES0H_ADRESH_POSN                              0x0
#define _AAD1RES0H_ADRESH_POSITION                          0x0
#define _AAD1RES0H_ADRESH_SIZE                              0x8
#define _AAD1RES0H_ADRESH_LENGTH                            0x8
#define _AAD1RES0H_ADRESH_MASK                              0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
} AD1RES0Hbits_t;
extern volatile AD1RES0Hbits_t AD1RES0Hbits __at(0x71B);
// bitfield macros
#define _AD1RES0H_ADRESH_POSN                               0x0
#define _AD1RES0H_ADRESH_POSITION                           0x0
#define _AD1RES0H_ADRESH_SIZE                               0x8
#define _AD1RES0H_ADRESH_LENGTH                             0x8
#define _AD1RES0H_ADRESH_MASK                               0xFF

// Register: AAD1RES1
#define AAD1RES1 AAD1RES1
extern volatile unsigned short          AAD1RES1            __at(0x71C);
#ifndef _LIB_BUILD
asm("AAD1RES1 equ 071Ch");
#endif
// aliases
extern volatile unsigned short          AD1RES1             __at(0x71C);
#ifndef _LIB_BUILD
asm("AD1RES1 equ 071Ch");
#endif
extern volatile unsigned short          ADRES1              __at(0x71C);
#ifndef _LIB_BUILD
asm("ADRES1 equ 071Ch");
#endif

// Register: AAD1RES1L
#define AAD1RES1L AAD1RES1L
extern volatile unsigned char           AAD1RES1L           __at(0x71C);
#ifndef _LIB_BUILD
asm("AAD1RES1L equ 071Ch");
#endif
// aliases
extern volatile unsigned char           AD1RES1L            __at(0x71C);
#ifndef _LIB_BUILD
asm("AD1RES1L equ 071Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESL                 :8;
    };
} AAD1RES1Lbits_t;
extern volatile AAD1RES1Lbits_t AAD1RES1Lbits __at(0x71C);
// bitfield macros
#define _AAD1RES1L_ADRESL_POSN                              0x0
#define _AAD1RES1L_ADRESL_POSITION                          0x0
#define _AAD1RES1L_ADRESL_SIZE                              0x8
#define _AAD1RES1L_ADRESL_LENGTH                            0x8
#define _AAD1RES1L_ADRESL_MASK                              0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADRESL                 :8;
    };
} AD1RES1Lbits_t;
extern volatile AD1RES1Lbits_t AD1RES1Lbits __at(0x71C);
// bitfield macros
#define _AD1RES1L_ADRESL_POSN                               0x0
#define _AD1RES1L_ADRESL_POSITION                           0x0
#define _AD1RES1L_ADRESL_SIZE                               0x8
#define _AD1RES1L_ADRESL_LENGTH                             0x8
#define _AD1RES1L_ADRESL_MASK                               0xFF

// Register: AAD1RES1H
#define AAD1RES1H AAD1RES1H
extern volatile unsigned char           AAD1RES1H           __at(0x71D);
#ifndef _LIB_BUILD
asm("AAD1RES1H equ 071Dh");
#endif
// aliases
extern volatile unsigned char           AD1RES1H            __at(0x71D);
#ifndef _LIB_BUILD
asm("AD1RES1H equ 071Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
} AAD1RES1Hbits_t;
extern volatile AAD1RES1Hbits_t AAD1RES1Hbits __at(0x71D);
// bitfield macros
#define _AAD1RES1H_ADRESH_POSN                              0x0
#define _AAD1RES1H_ADRESH_POSITION                          0x0
#define _AAD1RES1H_ADRESH_SIZE                              0x8
#define _AAD1RES1H_ADRESH_LENGTH                            0x8
#define _AAD1RES1H_ADRESH_MASK                              0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADRESH                 :8;
    };
} AD1RES1Hbits_t;
extern volatile AD1RES1Hbits_t AD1RES1Hbits __at(0x71D);
// bitfield macros
#define _AD1RES1H_ADRESH_POSN                               0x0
#define _AD1RES1H_ADRESH_POSITION                           0x0
#define _AD1RES1H_ADRESH_SIZE                               0x8
#define _AD1RES1H_ADRESH_LENGTH                             0x8
#define _AD1RES1H_ADRESH_MASK                               0xFF

// Register: AD1CH
#define AD1CH AD1CH
extern volatile unsigned char           AD1CH               __at(0x71E);
#ifndef _LIB_BUILD
asm("AD1CH equ 071Eh");
#endif
// aliases
extern volatile unsigned char           AAD1CH              __at(0x71E);
#ifndef _LIB_BUILD
asm("AAD1CH equ 071Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CH10                   :1;
        unsigned CH11                   :1;
        unsigned CH12                   :1;
        unsigned CH13                   :1;
        unsigned CH14                   :1;
        unsigned CH15                   :1;
        unsigned CH16                   :1;
    };
} AD1CHbits_t;
extern volatile AD1CHbits_t AD1CHbits __at(0x71E);
// bitfield macros
#define _AD1CH_CH10_POSN                                    0x0
#define _AD1CH_CH10_POSITION                                0x0
#define _AD1CH_CH10_SIZE                                    0x1
#define _AD1CH_CH10_LENGTH                                  0x1
#define _AD1CH_CH10_MASK                                    0x1
#define _AD1CH_CH11_POSN                                    0x1
#define _AD1CH_CH11_POSITION                                0x1
#define _AD1CH_CH11_SIZE                                    0x1
#define _AD1CH_CH11_LENGTH                                  0x1
#define _AD1CH_CH11_MASK                                    0x2
#define _AD1CH_CH12_POSN                                    0x2
#define _AD1CH_CH12_POSITION                                0x2
#define _AD1CH_CH12_SIZE                                    0x1
#define _AD1CH_CH12_LENGTH                                  0x1
#define _AD1CH_CH12_MASK                                    0x4
#define _AD1CH_CH13_POSN                                    0x3
#define _AD1CH_CH13_POSITION                                0x3
#define _AD1CH_CH13_SIZE                                    0x1
#define _AD1CH_CH13_LENGTH                                  0x1
#define _AD1CH_CH13_MASK                                    0x8
#define _AD1CH_CH14_POSN                                    0x4
#define _AD1CH_CH14_POSITION                                0x4
#define _AD1CH_CH14_SIZE                                    0x1
#define _AD1CH_CH14_LENGTH                                  0x1
#define _AD1CH_CH14_MASK                                    0x10
#define _AD1CH_CH15_POSN                                    0x5
#define _AD1CH_CH15_POSITION                                0x5
#define _AD1CH_CH15_SIZE                                    0x1
#define _AD1CH_CH15_LENGTH                                  0x1
#define _AD1CH_CH15_MASK                                    0x20
#define _AD1CH_CH16_POSN                                    0x6
#define _AD1CH_CH16_POSITION                                0x6
#define _AD1CH_CH16_SIZE                                    0x1
#define _AD1CH_CH16_LENGTH                                  0x1
#define _AD1CH_CH16_MASK                                    0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned CH10                   :1;
        unsigned CH11                   :1;
        unsigned CH12                   :1;
        unsigned CH13                   :1;
        unsigned CH14                   :1;
        unsigned CH15                   :1;
        unsigned CH16                   :1;
    };
} AAD1CHbits_t;
extern volatile AAD1CHbits_t AAD1CHbits __at(0x71E);
// bitfield macros
#define _AAD1CH_CH10_POSN                                   0x0
#define _AAD1CH_CH10_POSITION                               0x0
#define _AAD1CH_CH10_SIZE                                   0x1
#define _AAD1CH_CH10_LENGTH                                 0x1
#define _AAD1CH_CH10_MASK                                   0x1
#define _AAD1CH_CH11_POSN                                   0x1
#define _AAD1CH_CH11_POSITION                               0x1
#define _AAD1CH_CH11_SIZE                                   0x1
#define _AAD1CH_CH11_LENGTH                                 0x1
#define _AAD1CH_CH11_MASK                                   0x2
#define _AAD1CH_CH12_POSN                                   0x2
#define _AAD1CH_CH12_POSITION                               0x2
#define _AAD1CH_CH12_SIZE                                   0x1
#define _AAD1CH_CH12_LENGTH                                 0x1
#define _AAD1CH_CH12_MASK                                   0x4
#define _AAD1CH_CH13_POSN                                   0x3
#define _AAD1CH_CH13_POSITION                               0x3
#define _AAD1CH_CH13_SIZE                                   0x1
#define _AAD1CH_CH13_LENGTH                                 0x1
#define _AAD1CH_CH13_MASK                                   0x8
#define _AAD1CH_CH14_POSN                                   0x4
#define _AAD1CH_CH14_POSITION                               0x4
#define _AAD1CH_CH14_SIZE                                   0x1
#define _AAD1CH_CH14_LENGTH                                 0x1
#define _AAD1CH_CH14_MASK                                   0x10
#define _AAD1CH_CH15_POSN                                   0x5
#define _AAD1CH_CH15_POSITION                               0x5
#define _AAD1CH_CH15_SIZE                                   0x1
#define _AAD1CH_CH15_LENGTH                                 0x1
#define _AAD1CH_CH15_MASK                                   0x20
#define _AAD1CH_CH16_POSN                                   0x6
#define _AAD1CH_CH16_POSITION                               0x6
#define _AAD1CH_CH16_SIZE                                   0x1
#define _AAD1CH_CH16_LENGTH                                 0x1
#define _AAD1CH_CH16_MASK                                   0x40

// Register: AD2CON0
#define AD2CON0 AD2CON0
extern volatile unsigned char           AD2CON0             __at(0x791);
#ifndef _LIB_BUILD
asm("AD2CON0 equ 0791h");
#endif
// aliases
extern volatile unsigned char           AAD2CON0            __at(0x791);
#ifndef _LIB_BUILD
asm("AAD2CON0 equ 0791h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADON                   :1;
        unsigned GO                     :1;
        unsigned CHS                    :5;
    };
    struct {
        unsigned                        :1;
        unsigned GO_nDONE               :1;
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned CHS2                   :1;
        unsigned CHS3                   :1;
        unsigned CHS4                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned GO_nDONE2              :1;
    };
} AD2CON0bits_t;
extern volatile AD2CON0bits_t AD2CON0bits __at(0x791);
// bitfield macros
#define _AD2CON0_ADON_POSN                                  0x0
#define _AD2CON0_ADON_POSITION                              0x0
#define _AD2CON0_ADON_SIZE                                  0x1
#define _AD2CON0_ADON_LENGTH                                0x1
#define _AD2CON0_ADON_MASK                                  0x1
#define _AD2CON0_GO_POSN                                    0x1
#define _AD2CON0_GO_POSITION                                0x1
#define _AD2CON0_GO_SIZE                                    0x1
#define _AD2CON0_GO_LENGTH                                  0x1
#define _AD2CON0_GO_MASK                                    0x2
#define _AD2CON0_CHS_POSN                                   0x2
#define _AD2CON0_CHS_POSITION                               0x2
#define _AD2CON0_CHS_SIZE                                   0x5
#define _AD2CON0_CHS_LENGTH                                 0x5
#define _AD2CON0_CHS_MASK                                   0x7C
#define _AD2CON0_GO_nDONE_POSN                              0x1
#define _AD2CON0_GO_nDONE_POSITION                          0x1
#define _AD2CON0_GO_nDONE_SIZE                              0x1
#define _AD2CON0_GO_nDONE_LENGTH                            0x1
#define _AD2CON0_GO_nDONE_MASK                              0x2
#define _AD2CON0_CHS0_POSN                                  0x2
#define _AD2CON0_CHS0_POSITION                              0x2
#define _AD2CON0_CHS0_SIZE                                  0x1
#define _AD2CON0_CHS0_LENGTH                                0x1
#define _AD2CON0_CHS0_MASK                                  0x4
#define _AD2CON0_CHS1_POSN                                  0x3
#define _AD2CON0_CHS1_POSITION                              0x3
#define _AD2CON0_CHS1_SIZE                                  0x1
#define _AD2CON0_CHS1_LENGTH                                0x1
#define _AD2CON0_CHS1_MASK                                  0x8
#define _AD2CON0_CHS2_POSN                                  0x4
#define _AD2CON0_CHS2_POSITION                              0x4
#define _AD2CON0_CHS2_SIZE                                  0x1
#define _AD2CON0_CHS2_LENGTH                                0x1
#define _AD2CON0_CHS2_MASK                                  0x10
#define _AD2CON0_CHS3_POSN                                  0x5
#define _AD2CON0_CHS3_POSITION                              0x5
#define _AD2CON0_CHS3_SIZE                                  0x1
#define _AD2CON0_CHS3_LENGTH                                0x1
#define _AD2CON0_CHS3_MASK                                  0x20
#define _AD2CON0_CHS4_POSN                                  0x6
#define _AD2CON0_CHS4_POSITION                              0x6
#define _AD2CON0_CHS4_SIZE                                  0x1
#define _AD2CON0_CHS4_LENGTH                                0x1
#define _AD2CON0_CHS4_MASK                                  0x40
#define _AD2CON0_GO_nDONE2_POSN                             0x1
#define _AD2CON0_GO_nDONE2_POSITION                         0x1
#define _AD2CON0_GO_nDONE2_SIZE                             0x1
#define _AD2CON0_GO_nDONE2_LENGTH                           0x1
#define _AD2CON0_GO_nDONE2_MASK                             0x2
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADON                   :1;
        unsigned GO                     :1;
        unsigned CHS                    :5;
    };
    struct {
        unsigned                        :1;
        unsigned GO_nDONE               :1;
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned CHS2                   :1;
        unsigned CHS3                   :1;
        unsigned CHS4                   :1;
    };
    struct {
        unsigned                        :1;
        unsigned GO_nDONE2              :1;
    };
} AAD2CON0bits_t;
extern volatile AAD2CON0bits_t AAD2CON0bits __at(0x791);
// bitfield macros
#define _AAD2CON0_ADON_POSN                                 0x0
#define _AAD2CON0_ADON_POSITION                             0x0
#define _AAD2CON0_ADON_SIZE                                 0x1
#define _AAD2CON0_ADON_LENGTH                               0x1
#define _AAD2CON0_ADON_MASK                                 0x1
#define _AAD2CON0_GO_POSN                                   0x1
#define _AAD2CON0_GO_POSITION                               0x1
#define _AAD2CON0_GO_SIZE                                   0x1
#define _AAD2CON0_GO_LENGTH                                 0x1
#define _AAD2CON0_GO_MASK                                   0x2
#define _AAD2CON0_CHS_POSN                                  0x2
#define _AAD2CON0_CHS_POSITION                              0x2
#define _AAD2CON0_CHS_SIZE                                  0x5
#define _AAD2CON0_CHS_LENGTH                                0x5
#define _AAD2CON0_CHS_MASK                                  0x7C
#define _AAD2CON0_GO_nDONE_POSN                             0x1
#define _AAD2CON0_GO_nDONE_POSITION                         0x1
#define _AAD2CON0_GO_nDONE_SIZE                             0x1
#define _AAD2CON0_GO_nDONE_LENGTH                           0x1
#define _AAD2CON0_GO_nDONE_MASK                             0x2
#define _AAD2CON0_CHS0_POSN                                 0x2
#define _AAD2CON0_CHS0_POSITION                             0x2
#define _AAD2CON0_CHS0_SIZE                                 0x1
#define _AAD2CON0_CHS0_LENGTH                               0x1
#define _AAD2CON0_CHS0_MASK                                 0x4
#define _AAD2CON0_CHS1_POSN                                 0x3
#define _AAD2CON0_CHS1_POSITION                             0x3
#define _AAD2CON0_CHS1_SIZE                                 0x1
#define _AAD2CON0_CHS1_LENGTH                               0x1
#define _AAD2CON0_CHS1_MASK                                 0x8
#define _AAD2CON0_CHS2_POSN                                 0x4
#define _AAD2CON0_CHS2_POSITION                             0x4
#define _AAD2CON0_CHS2_SIZE                                 0x1
#define _AAD2CON0_CHS2_LENGTH                               0x1
#define _AAD2CON0_CHS2_MASK                                 0x10
#define _AAD2CON0_CHS3_POSN                                 0x5
#define _AAD2CON0_CHS3_POSITION                             0x5
#define _AAD2CON0_CHS3_SIZE                                 0x1
#define _AAD2CON0_CHS3_LENGTH                               0x1
#define _AAD2CON0_CHS3_MASK                                 0x20
#define _AAD2CON0_CHS4_POSN                                 0x6
#define _AAD2CON0_CHS4_POSITION                             0x6
#define _AAD2CON0_CHS4_SIZE                                 0x1
#define _AAD2CON0_CHS4_LENGTH                               0x1
#define _AAD2CON0_CHS4_MASK                                 0x40
#define _AAD2CON0_GO_nDONE2_POSN                            0x1
#define _AAD2CON0_GO_nDONE2_POSITION                        0x1
#define _AAD2CON0_GO_nDONE2_SIZE                            0x1
#define _AAD2CON0_GO_nDONE2_LENGTH                          0x1
#define _AAD2CON0_GO_nDONE2_MASK                            0x2

// Register: AD2CON2
#define AD2CON2 AD2CON2
extern volatile unsigned char           AD2CON2             __at(0x793);
#ifndef _LIB_BUILD
asm("AD2CON2 equ 0793h");
#endif
// aliases
extern volatile unsigned char           AAD2CON2            __at(0x793);
#ifndef _LIB_BUILD
asm("AAD2CON2 equ 0793h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned TRIGSEL                :3;
    };
    struct {
        unsigned                        :4;
        unsigned TRIGSEL0               :1;
        unsigned TRIGSEL1               :1;
        unsigned TRIGSEL2               :1;
    };
} AD2CON2bits_t;
extern volatile AD2CON2bits_t AD2CON2bits __at(0x793);
// bitfield macros
#define _AD2CON2_TRIGSEL_POSN                               0x4
#define _AD2CON2_TRIGSEL_POSITION                           0x4
#define _AD2CON2_TRIGSEL_SIZE                               0x3
#define _AD2CON2_TRIGSEL_LENGTH                             0x3
#define _AD2CON2_TRIGSEL_MASK                               0x70
#define _AD2CON2_TRIGSEL0_POSN                              0x4
#define _AD2CON2_TRIGSEL0_POSITION                          0x4
#define _AD2CON2_TRIGSEL0_SIZE                              0x1
#define _AD2CON2_TRIGSEL0_LENGTH                            0x1
#define _AD2CON2_TRIGSEL0_MASK                              0x10
#define _AD2CON2_TRIGSEL1_POSN                              0x5
#define _AD2CON2_TRIGSEL1_POSITION                          0x5
#define _AD2CON2_TRIGSEL1_SIZE                              0x1
#define _AD2CON2_TRIGSEL1_LENGTH                            0x1
#define _AD2CON2_TRIGSEL1_MASK                              0x20
#define _AD2CON2_TRIGSEL2_POSN                              0x6
#define _AD2CON2_TRIGSEL2_POSITION                          0x6
#define _AD2CON2_TRIGSEL2_SIZE                              0x1
#define _AD2CON2_TRIGSEL2_LENGTH                            0x1
#define _AD2CON2_TRIGSEL2_MASK                              0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned TRIGSEL                :3;
    };
    struct {
        unsigned                        :4;
        unsigned TRIGSEL0               :1;
        unsigned TRIGSEL1               :1;
        unsigned TRIGSEL2               :1;
    };
} AAD2CON2bits_t;
extern volatile AAD2CON2bits_t AAD2CON2bits __at(0x793);
// bitfield macros
#define _AAD2CON2_TRIGSEL_POSN                              0x4
#define _AAD2CON2_TRIGSEL_POSITION                          0x4
#define _AAD2CON2_TRIGSEL_SIZE                              0x3
#define _AAD2CON2_TRIGSEL_LENGTH                            0x3
#define _AAD2CON2_TRIGSEL_MASK                              0x70
#define _AAD2CON2_TRIGSEL0_POSN                             0x4
#define _AAD2CON2_TRIGSEL0_POSITION                         0x4
#define _AAD2CON2_TRIGSEL0_SIZE                             0x1
#define _AAD2CON2_TRIGSEL0_LENGTH                           0x1
#define _AAD2CON2_TRIGSEL0_MASK                             0x10
#define _AAD2CON2_TRIGSEL1_POSN                             0x5
#define _AAD2CON2_TRIGSEL1_POSITION                         0x5
#define _AAD2CON2_TRIGSEL1_SIZE                             0x1
#define _AAD2CON2_TRIGSEL1_LENGTH                           0x1
#define _AAD2CON2_TRIGSEL1_MASK                             0x20
#define _AAD2CON2_TRIGSEL2_POSN                             0x6
#define _AAD2CON2_TRIGSEL2_POSITION                         0x6
#define _AAD2CON2_TRIGSEL2_SIZE                             0x1
#define _AAD2CON2_TRIGSEL2_LENGTH                           0x1
#define _AAD2CON2_TRIGSEL2_MASK                             0x40

