MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1559/mcu.h
extern volatile AAD2PREbits_t AAD2PREbits __at(0x796);
// bitfield macros
#define _AAD2PRE_ADPRE_POSN                                 0x0
#define _AAD2PRE_ADPRE_POSITION                             0x0
#define _AAD2PRE_ADPRE_SIZE                                 0x7
#define _AAD2PRE_ADPRE_LENGTH                               0x7
#define _AAD2PRE_ADPRE_MASK                                 0x7F
#define _AAD2PRE_ADPRE0_POSN                                0x0
#define _AAD2PRE_ADPRE0_POSITION                            0x0
#define _AAD2PRE_ADPRE0_SIZE                                0x1
#define _AAD2PRE_ADPRE0_LENGTH                              0x1
#define _AAD2PRE_ADPRE0_MASK                                0x1
#define _AAD2PRE_ADPRE1_POSN                                0x1
#define _AAD2PRE_ADPRE1_POSITION                            0x1
#define _AAD2PRE_ADPRE1_SIZE                                0x1
#define _AAD2PRE_ADPRE1_LENGTH                              0x1
#define _AAD2PRE_ADPRE1_MASK                                0x2
#define _AAD2PRE_ADPRE2_POSN                                0x2
#define _AAD2PRE_ADPRE2_POSITION                            0x2
#define _AAD2PRE_ADPRE2_SIZE                                0x1
#define _AAD2PRE_ADPRE2_LENGTH                              0x1
#define _AAD2PRE_ADPRE2_MASK                                0x4
#define _AAD2PRE_ADPRE3_POSN                                0x3
#define _AAD2PRE_ADPRE3_POSITION                            0x3
#define _AAD2PRE_ADPRE3_SIZE                                0x1
#define _AAD2PRE_ADPRE3_LENGTH                              0x1
#define _AAD2PRE_ADPRE3_MASK                                0x8
#define _AAD2PRE_ADPRE4_POSN                                0x4
#define _AAD2PRE_ADPRE4_POSITION                            0x4
#define _AAD2PRE_ADPRE4_SIZE                                0x1
#define _AAD2PRE_ADPRE4_LENGTH                              0x1
#define _AAD2PRE_ADPRE4_MASK                                0x10
#define _AAD2PRE_ADPRE5_POSN                                0x5
#define _AAD2PRE_ADPRE5_POSITION                            0x5
#define _AAD2PRE_ADPRE5_SIZE                                0x1
#define _AAD2PRE_ADPRE5_LENGTH                              0x1
#define _AAD2PRE_ADPRE5_MASK                                0x20
#define _AAD2PRE_ADPRE6_POSN                                0x6
#define _AAD2PRE_ADPRE6_POSITION                            0x6
#define _AAD2PRE_ADPRE6_SIZE                                0x1
#define _AAD2PRE_ADPRE6_LENGTH                              0x1
#define _AAD2PRE_ADPRE6_MASK                                0x40

// Register: AD2ACQCON
#define AD2ACQCON AD2ACQCON
extern volatile unsigned char           AD2ACQCON           __at(0x797);
#ifndef _LIB_BUILD
asm("AD2ACQCON equ 0797h");
#endif
// aliases
extern volatile unsigned char           AD2ACQ              __at(0x797);
#ifndef _LIB_BUILD
asm("AD2ACQ equ 0797h");
#endif
extern volatile unsigned char           AAD2ACQ             __at(0x797);
#ifndef _LIB_BUILD
asm("AAD2ACQ equ 0797h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADACQ                  :7;
    };
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
    };
} AD2ACQCONbits_t;
extern volatile AD2ACQCONbits_t AD2ACQCONbits __at(0x797);
// bitfield macros
#define _AD2ACQCON_ADACQ_POSN                               0x0
#define _AD2ACQCON_ADACQ_POSITION                           0x0
#define _AD2ACQCON_ADACQ_SIZE                               0x7
#define _AD2ACQCON_ADACQ_LENGTH                             0x7
#define _AD2ACQCON_ADACQ_MASK                               0x7F
#define _AD2ACQCON_ADACQ0_POSN                              0x0
#define _AD2ACQCON_ADACQ0_POSITION                          0x0
#define _AD2ACQCON_ADACQ0_SIZE                              0x1
#define _AD2ACQCON_ADACQ0_LENGTH                            0x1
#define _AD2ACQCON_ADACQ0_MASK                              0x1
#define _AD2ACQCON_ADACQ1_POSN                              0x1
#define _AD2ACQCON_ADACQ1_POSITION                          0x1
#define _AD2ACQCON_ADACQ1_SIZE                              0x1
#define _AD2ACQCON_ADACQ1_LENGTH                            0x1
#define _AD2ACQCON_ADACQ1_MASK                              0x2
#define _AD2ACQCON_ADACQ2_POSN                              0x2
#define _AD2ACQCON_ADACQ2_POSITION                          0x2
#define _AD2ACQCON_ADACQ2_SIZE                              0x1
#define _AD2ACQCON_ADACQ2_LENGTH                            0x1
#define _AD2ACQCON_ADACQ2_MASK                              0x4
#define _AD2ACQCON_ADACQ3_POSN                              0x3
#define _AD2ACQCON_ADACQ3_POSITION                          0x3
#define _AD2ACQCON_ADACQ3_SIZE                              0x1
#define _AD2ACQCON_ADACQ3_LENGTH                            0x1
#define _AD2ACQCON_ADACQ3_MASK                              0x8
#define _AD2ACQCON_ADACQ4_POSN                              0x4
#define _AD2ACQCON_ADACQ4_POSITION                          0x4
#define _AD2ACQCON_ADACQ4_SIZE                              0x1
#define _AD2ACQCON_ADACQ4_LENGTH                            0x1
#define _AD2ACQCON_ADACQ4_MASK                              0x10
#define _AD2ACQCON_ADACQ5_POSN                              0x5
#define _AD2ACQCON_ADACQ5_POSITION                          0x5
#define _AD2ACQCON_ADACQ5_SIZE                              0x1
#define _AD2ACQCON_ADACQ5_LENGTH                            0x1
#define _AD2ACQCON_ADACQ5_MASK                              0x20
#define _AD2ACQCON_ADACQ6_POSN                              0x6
#define _AD2ACQCON_ADACQ6_POSITION                          0x6
#define _AD2ACQCON_ADACQ6_SIZE                              0x1
#define _AD2ACQCON_ADACQ6_LENGTH                            0x1
#define _AD2ACQCON_ADACQ6_MASK                              0x40
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADACQ                  :7;
    };
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
    };
} AD2ACQbits_t;
extern volatile AD2ACQbits_t AD2ACQbits __at(0x797);
// bitfield macros
#define _AD2ACQ_ADACQ_POSN                                  0x0
#define _AD2ACQ_ADACQ_POSITION                              0x0
#define _AD2ACQ_ADACQ_SIZE                                  0x7
#define _AD2ACQ_ADACQ_LENGTH                                0x7
#define _AD2ACQ_ADACQ_MASK                                  0x7F
#define _AD2ACQ_ADACQ0_POSN                                 0x0
#define _AD2ACQ_ADACQ0_POSITION                             0x0
#define _AD2ACQ_ADACQ0_SIZE                                 0x1
#define _AD2ACQ_ADACQ0_LENGTH                               0x1
#define _AD2ACQ_ADACQ0_MASK                                 0x1
#define _AD2ACQ_ADACQ1_POSN                                 0x1
#define _AD2ACQ_ADACQ1_POSITION                             0x1
#define _AD2ACQ_ADACQ1_SIZE                                 0x1
#define _AD2ACQ_ADACQ1_LENGTH                               0x1
#define _AD2ACQ_ADACQ1_MASK                                 0x2
#define _AD2ACQ_ADACQ2_POSN                                 0x2
#define _AD2ACQ_ADACQ2_POSITION                             0x2
#define _AD2ACQ_ADACQ2_SIZE                                 0x1
#define _AD2ACQ_ADACQ2_LENGTH                               0x1
#define _AD2ACQ_ADACQ2_MASK                                 0x4
#define _AD2ACQ_ADACQ3_POSN                                 0x3
#define _AD2ACQ_ADACQ3_POSITION                             0x3
#define _AD2ACQ_ADACQ3_SIZE                                 0x1
#define _AD2ACQ_ADACQ3_LENGTH                               0x1
#define _AD2ACQ_ADACQ3_MASK                                 0x8
#define _AD2ACQ_ADACQ4_POSN                                 0x4
#define _AD2ACQ_ADACQ4_POSITION                             0x4
#define _AD2ACQ_ADACQ4_SIZE                                 0x1
#define _AD2ACQ_ADACQ4_LENGTH                               0x1
#define _AD2ACQ_ADACQ4_MASK                                 0x10
#define _AD2ACQ_ADACQ5_POSN                                 0x5
#define _AD2ACQ_ADACQ5_POSITION                             0x5
#define _AD2ACQ_ADACQ5_SIZE                                 0x1
#define _AD2ACQ_ADACQ5_LENGTH                               0x1
#define _AD2ACQ_ADACQ5_MASK                                 0x20
#define _AD2ACQ_ADACQ6_POSN                                 0x6
#define _AD2ACQ_ADACQ6_POSITION                             0x6
#define _AD2ACQ_ADACQ6_SIZE                                 0x1
#define _AD2ACQ_ADACQ6_LENGTH                               0x1
#define _AD2ACQ_ADACQ6_MASK                                 0x40
typedef union {
    struct {
        unsigned ADACQ                  :7;
    };
    struct {
        unsigned ADACQ0                 :1;
        unsigned ADACQ1                 :1;
        unsigned ADACQ2                 :1;
        unsigned ADACQ3                 :1;
        unsigned ADACQ4                 :1;
        unsigned ADACQ5                 :1;
        unsigned ADACQ6                 :1;
    };
} AAD2ACQbits_t;
extern volatile AAD2ACQbits_t AAD2ACQbits __at(0x797);
// bitfield macros
#define _AAD2ACQ_ADACQ_POSN                                 0x0
#define _AAD2ACQ_ADACQ_POSITION                             0x0
#define _AAD2ACQ_ADACQ_SIZE                                 0x7
#define _AAD2ACQ_ADACQ_LENGTH                               0x7
#define _AAD2ACQ_ADACQ_MASK                                 0x7F
#define _AAD2ACQ_ADACQ0_POSN                                0x0
#define _AAD2ACQ_ADACQ0_POSITION                            0x0
#define _AAD2ACQ_ADACQ0_SIZE                                0x1
#define _AAD2ACQ_ADACQ0_LENGTH                              0x1
#define _AAD2ACQ_ADACQ0_MASK                                0x1
#define _AAD2ACQ_ADACQ1_POSN                                0x1
#define _AAD2ACQ_ADACQ1_POSITION                            0x1
#define _AAD2ACQ_ADACQ1_SIZE                                0x1
#define _AAD2ACQ_ADACQ1_LENGTH                              0x1
#define _AAD2ACQ_ADACQ1_MASK                                0x2
#define _AAD2ACQ_ADACQ2_POSN                                0x2
#define _AAD2ACQ_ADACQ2_POSITION                            0x2
#define _AAD2ACQ_ADACQ2_SIZE                                0x1
#define _AAD2ACQ_ADACQ2_LENGTH                              0x1
#define _AAD2ACQ_ADACQ2_MASK                                0x4
#define _AAD2ACQ_ADACQ3_POSN                                0x3
#define _AAD2ACQ_ADACQ3_POSITION                            0x3
#define _AAD2ACQ_ADACQ3_SIZE                                0x1
#define _AAD2ACQ_ADACQ3_LENGTH                              0x1
#define _AAD2ACQ_ADACQ3_MASK                                0x8
#define _AAD2ACQ_ADACQ4_POSN                                0x4
#define _AAD2ACQ_ADACQ4_POSITION                            0x4
#define _AAD2ACQ_ADACQ4_SIZE                                0x1
#define _AAD2ACQ_ADACQ4_LENGTH                              0x1
#define _AAD2ACQ_ADACQ4_MASK                                0x10
#define _AAD2ACQ_ADACQ5_POSN                                0x5
#define _AAD2ACQ_ADACQ5_POSITION                            0x5
#define _AAD2ACQ_ADACQ5_SIZE                                0x1
#define _AAD2ACQ_ADACQ5_LENGTH                              0x1
#define _AAD2ACQ_ADACQ5_MASK                                0x20
#define _AAD2ACQ_ADACQ6_POSN                                0x6
#define _AAD2ACQ_ADACQ6_POSITION                            0x6
#define _AAD2ACQ_ADACQ6_SIZE                                0x1
#define _AAD2ACQ_ADACQ6_LENGTH                              0x1
#define _AAD2ACQ_ADACQ6_MASK                                0x40

