MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1559/mcu.h
// Register: ICDBK0L
#define ICDBK0L ICDBK0L
extern volatile unsigned char           ICDBK0L             __at(0xF9D);
#ifndef _LIB_BUILD
asm("ICDBK0L equ 0F9Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BKA0                   :1;
        unsigned BKA1                   :1;
        unsigned BKA2                   :1;
        unsigned BKA3                   :1;
        unsigned BKA4                   :1;
        unsigned BKA5                   :1;
        unsigned BKA6                   :1;
        unsigned BKA7                   :1;
    };
} ICDBK0Lbits_t;
extern volatile ICDBK0Lbits_t ICDBK0Lbits __at(0xF9D);
// bitfield macros
#define _ICDBK0L_BKA0_POSN                                  0x0
#define _ICDBK0L_BKA0_POSITION                              0x0
#define _ICDBK0L_BKA0_SIZE                                  0x1
#define _ICDBK0L_BKA0_LENGTH                                0x1
#define _ICDBK0L_BKA0_MASK                                  0x1
#define _ICDBK0L_BKA1_POSN                                  0x1
#define _ICDBK0L_BKA1_POSITION                              0x1
#define _ICDBK0L_BKA1_SIZE                                  0x1
#define _ICDBK0L_BKA1_LENGTH                                0x1
#define _ICDBK0L_BKA1_MASK                                  0x2
#define _ICDBK0L_BKA2_POSN                                  0x2
#define _ICDBK0L_BKA2_POSITION                              0x2
#define _ICDBK0L_BKA2_SIZE                                  0x1
#define _ICDBK0L_BKA2_LENGTH                                0x1
#define _ICDBK0L_BKA2_MASK                                  0x4
#define _ICDBK0L_BKA3_POSN                                  0x3
#define _ICDBK0L_BKA3_POSITION                              0x3
#define _ICDBK0L_BKA3_SIZE                                  0x1
#define _ICDBK0L_BKA3_LENGTH                                0x1
#define _ICDBK0L_BKA3_MASK                                  0x8
#define _ICDBK0L_BKA4_POSN                                  0x4
#define _ICDBK0L_BKA4_POSITION                              0x4
#define _ICDBK0L_BKA4_SIZE                                  0x1
#define _ICDBK0L_BKA4_LENGTH                                0x1
#define _ICDBK0L_BKA4_MASK                                  0x10
#define _ICDBK0L_BKA5_POSN                                  0x5
#define _ICDBK0L_BKA5_POSITION                              0x5
#define _ICDBK0L_BKA5_SIZE                                  0x1
#define _ICDBK0L_BKA5_LENGTH                                0x1
#define _ICDBK0L_BKA5_MASK                                  0x20
#define _ICDBK0L_BKA6_POSN                                  0x6
#define _ICDBK0L_BKA6_POSITION                              0x6
#define _ICDBK0L_BKA6_SIZE                                  0x1
#define _ICDBK0L_BKA6_LENGTH                                0x1
#define _ICDBK0L_BKA6_MASK                                  0x40
#define _ICDBK0L_BKA7_POSN                                  0x7
#define _ICDBK0L_BKA7_POSITION                              0x7
#define _ICDBK0L_BKA7_SIZE                                  0x1
#define _ICDBK0L_BKA7_LENGTH                                0x1
#define _ICDBK0L_BKA7_MASK                                  0x80

// Register: ICDBK0H
#define ICDBK0H ICDBK0H
extern volatile unsigned char           ICDBK0H             __at(0xF9E);
#ifndef _LIB_BUILD
asm("ICDBK0H equ 0F9Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BKA8                   :1;
        unsigned BKA9                   :1;
        unsigned BKA10                  :1;
        unsigned BKA11                  :1;
        unsigned BKA12                  :1;
        unsigned BKA13                  :1;
        unsigned BKA14                  :1;
    };
} ICDBK0Hbits_t;
extern volatile ICDBK0Hbits_t ICDBK0Hbits __at(0xF9E);
// bitfield macros
#define _ICDBK0H_BKA8_POSN                                  0x0
#define _ICDBK0H_BKA8_POSITION                              0x0
#define _ICDBK0H_BKA8_SIZE                                  0x1
#define _ICDBK0H_BKA8_LENGTH                                0x1
#define _ICDBK0H_BKA8_MASK                                  0x1
#define _ICDBK0H_BKA9_POSN                                  0x1
#define _ICDBK0H_BKA9_POSITION                              0x1
#define _ICDBK0H_BKA9_SIZE                                  0x1
#define _ICDBK0H_BKA9_LENGTH                                0x1
#define _ICDBK0H_BKA9_MASK                                  0x2
#define _ICDBK0H_BKA10_POSN                                 0x2
#define _ICDBK0H_BKA10_POSITION                             0x2
#define _ICDBK0H_BKA10_SIZE                                 0x1
#define _ICDBK0H_BKA10_LENGTH                               0x1
#define _ICDBK0H_BKA10_MASK                                 0x4
#define _ICDBK0H_BKA11_POSN                                 0x3
#define _ICDBK0H_BKA11_POSITION                             0x3
#define _ICDBK0H_BKA11_SIZE                                 0x1
#define _ICDBK0H_BKA11_LENGTH                               0x1
#define _ICDBK0H_BKA11_MASK                                 0x8
#define _ICDBK0H_BKA12_POSN                                 0x4
#define _ICDBK0H_BKA12_POSITION                             0x4
#define _ICDBK0H_BKA12_SIZE                                 0x1
#define _ICDBK0H_BKA12_LENGTH                               0x1
#define _ICDBK0H_BKA12_MASK                                 0x10
#define _ICDBK0H_BKA13_POSN                                 0x5
#define _ICDBK0H_BKA13_POSITION                             0x5
#define _ICDBK0H_BKA13_SIZE                                 0x1
#define _ICDBK0H_BKA13_LENGTH                               0x1
#define _ICDBK0H_BKA13_MASK                                 0x20
#define _ICDBK0H_BKA14_POSN                                 0x6
#define _ICDBK0H_BKA14_POSITION                             0x6
#define _ICDBK0H_BKA14_SIZE                                 0x1
#define _ICDBK0H_BKA14_LENGTH                               0x1
#define _ICDBK0H_BKA14_MASK                                 0x40

// Register: BSRICDSHAD
#define BSRICDSHAD BSRICDSHAD
extern volatile unsigned char           BSRICDSHAD          __at(0xFE3);
#ifndef _LIB_BUILD
asm("BSRICDSHAD equ 0FE3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BSR_ICDSHAD            :5;
    };
} BSRICDSHADbits_t;
extern volatile BSRICDSHADbits_t BSRICDSHADbits __at(0xFE3);
// bitfield macros
#define _BSRICDSHAD_BSR_ICDSHAD_POSN                        0x0
#define _BSRICDSHAD_BSR_ICDSHAD_POSITION                    0x0
#define _BSRICDSHAD_BSR_ICDSHAD_SIZE                        0x5
#define _BSRICDSHAD_BSR_ICDSHAD_LENGTH                      0x5
#define _BSRICDSHAD_BSR_ICDSHAD_MASK                        0x1F

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0xFE4);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 0FE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C_SHAD                 :1;
        unsigned DC_SHAD                :1;
        unsigned Z_SHAD                 :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0xFE4);
// bitfield macros
#define _STATUS_SHAD_C_SHAD_POSN                            0x0
#define _STATUS_SHAD_C_SHAD_POSITION                        0x0
#define _STATUS_SHAD_C_SHAD_SIZE                            0x1
#define _STATUS_SHAD_C_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_C_SHAD_MASK                            0x1
#define _STATUS_SHAD_DC_SHAD_POSN                           0x1
#define _STATUS_SHAD_DC_SHAD_POSITION                       0x1
#define _STATUS_SHAD_DC_SHAD_SIZE                           0x1
#define _STATUS_SHAD_DC_SHAD_LENGTH                         0x1
#define _STATUS_SHAD_DC_SHAD_MASK                           0x2
#define _STATUS_SHAD_Z_SHAD_POSN                            0x2
#define _STATUS_SHAD_Z_SHAD_POSITION                        0x2
#define _STATUS_SHAD_Z_SHAD_SIZE                            0x1
#define _STATUS_SHAD_Z_SHAD_LENGTH                          0x1
#define _STATUS_SHAD_Z_SHAD_MASK                            0x4

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0xFE5);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 0FE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG_SHAD              :8;
    };
} WREG_SHADbits_t;
